#include <stdio.h>
int main(){
	char* day[] = {"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"};
	int t, m, d, total[] = {0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334, 365};
	scanf("%d", &t);
	while(t--) scanf("%d%d", &m, &d), puts(day[(total[m - 1] + d + 4) % 7]);
	return 0;
}

/*
１. 因為 2011/1/10 是星期一，所以 2011/1/1 推回去就是星期六。　2011/1/1 (六)　再往前推算星期一在幾年幾號
    得出 2010/12/27(一)，故 2011年某月某日經過的天數還要在加上 4 天，這樣之後求於數為０就代表星期一
  
  12/27(1) ... 0
	12/28(2) ... 1
	12/29(3) ... 2
	12/30(4) ... 3
	12/31(5) ... 4
	1/1(6) ... 5
*/
